app/controllers/catalog_controller.rb

    def show
      @response, @document = search_service.fetch URI.unescape(params[:id])

      # if we are showing a volume, fetch list of all works in the volume
      if @document['cat_ssi'].starts_with? 'volume'
        (@work_resp, @work_docs) =  search_service.search_results() do |builder|
          if respond_to? (:blacklight_config)
            builder = blacklight_config.search_builder_class.new([:default_solr_parameters,:part_of_volume_search],builder)
            builder = builder.with({volumeid: @document['volume_id_ssi']})
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" IN (4, 1) AND "searches"."id" = ? ORDER BY updated_at desc LIMIT ?  [["id", 4], ["LIMIT", 1]]